{
    "Key": "elasticsearch_infographics",
    "Title": "Elastic Search",
    "Subtitle": "A Near Real-Time Search Engine",
    "Avatar": "/img/logo/elasticsearch.png",
    "Color": "Red",
    "Articles": [{
            "Key": "article_1619513323561",
            "Color": "Purple",
            "SectionHeight": "150px",
            "Layout": "layout-3321",
            "Sections": [{
                    "Key": "article_1629513323562",
                    "Color": "Purple",
                    "Order": 0,
                    "Title": "Field",
                    "Subtitle": "Smallest Individual Unit",
                    "Content": "The smallest individual unit of data in Elasticsearch. Each field has a defined datatype and contains a single piece of data.\n"
                },
                {
                    "Key": "section_1625647675243",
                    "Color": "Purple",
                    "Title": "Analyzer",
                    "Subtitle": "Optimize Data For Search",
                    "Content": "Allows us to convert unstructured text into a format optimized for search. Analyzers are used during indexing to break down – or parse – phrases and expressions into their constituent terms. \n",
                    "Order": 1
                },
                {
                    "Key": "section_1625647803718",
                    "Color": "Purple",
                    "Title": "Document",
                    "Content": "Documents are JSON objects that are stored within an index and are considered the base unit of storage. In the world of relational databases, documents can be compared to a row in the table.",
                    "Subtitle": "Base Unit Of Storage",
                    "Order": 2
                }
            ]
        },
        {
            "Key": "article_1625647868968",
            "SectionHeight": "150px",
            "Color": "Indigo",
            "Title": "Mapping",
            "Subtitle": "Process of Defining How a Document & Fields are Stored & Indexed",
            "Footer": "Each document is a collection with their own data types.",
            "Order": 1,
            "Layout": "layout-2211",
            "Sections": [{
                    "Key": "section_1625648012368",
                    "Color": "Indigo",
                    "Title": "Dynamic Mapping",
                    "Subtitle": "Adds new fields mapping automatically",
                    "Content": "Adds new fields mapping automatically, just by indexing a document. We can add fields to the top-level mapping, to inner object and nested fields.",
                    "Order": 0
                },
                {
                    "Key": "section_1625648058900",
                    "Color": "Indigo",
                    "Title": "Explicit Mapping",
                    "Subtitle": "Precisely Choose & Define",
                    "Content": "Allows us to precisely choose how to define the mapping definition, such as: Which string fields should be treated as full-text fields. Which fields contain numbers, dates, or geolocations. The format of date values. Custom rules to control the mapping for dynamically added fields.",
                    "Order": 1
                }
            ]
        },
        {
            "Key": "article_1625648823706",
            "SectionHeight": "150px",
            "Layout": "layout-2211",
            "Color": "Teal",
            "Title": "Node",
            "Subtitle": "A running instance of elastic search",
            "Footer": "Just like a cluster, a node is identified by a name",
            "Order": 3,
            "Sections": [{
                    "Key": "section_1625648887280",
                    "Color": "Teal",
                    "Title": "Master Node",
                    "Content": "A node that has the master role, which makes it eligible to be elected as the master node, which controls the cluster management and configuration actions such as adding and removing nodes.",
                    "Subtitle": "A node that has the master role",
                    "Order": 0
                },
                {
                    "Key": "section_1625648922959",
                    "Color": "Teal",
                    "Title": "Data Node",
                    "Subtitle": "A node that has the data role",
                    "Content": "A node that has the data role. Data nodes hold data and perform data-related operations such as CRUD, search, and aggregations. A node with the data role can fill any of the specialized data node roles.",
                    "Order": 1
                },
                {
                    "Key": "section_1625648952072",
                    "Color": "Teal",
                    "Title": "Ingestion Node",
                    "Subtitle": "A node that has the ingest role",
                    "Content": "A node that has the ingest role. Ingest nodes are able to apply an ingest pipeline to a document in order to transform and enrich the document before indexing. With a heavy ingest load, it makes sense to use dedicated ingest nodes.",
                    "Order": 2
                },
                {
                    "Key": "section_1625648994896",
                    "Color": "Teal",
                    "Title": "Coordinator Nodes",
                    "Content": "Coordinating only nodes can benefit large clusters by offloading the coordinating node role from data and master-eligible nodes. Adding too many coordinating only nodes to a cluster can increase the burden on the entire cluster.\n",
                    "Subtitle": "Can benefit large clusters",
                    "Order": 3
                }
            ]
        },
        {
            "Key": "article_1625648152983",
            "SectionHeight": "150px",
            "Color": "Red",
            "Title": "Index",
            "Subtitle": " A Logical Namespace",
            "Footer": "An index is like a table in a relational database. It is a logical namespace (must be lowercased)",
            "Order": 2,
            "Sections": [{
                    "Key": "section_1625648228520",
                    "Color": "Red",
                    "Title": "Hot",
                    "Content": "Handles all indexing of new data in the cluster and holds the most recent daily indices that tend to be queried most frequently.",
                    "Order": 0,
                    "Subtitle": " Frequent Update"
                },
                {
                    "Key": "section_1625648285720",
                    "Color": "Red",
                    "Title": "Warm",
                    "Content": "Handles a large amount of read-only indices that are not queried frequently. With read-only indices, warm nodes can use very large spindle drives instead of SSD storage.",
                    "Order": 1,
                    "Subtitle": "No Update"
                },
                {
                    "Key": "section_1625648548638",
                    "Color": "Red",
                    "Title": "Cold",
                    "Content": "Once data is no longer being updated, it can move from the warm tier to the cold tier where it stays while being queried infrequently. The cold tier is still a responsive query tier, but data in the cold tier is not normally updated.",
                    "Order": 2,
                    "Subtitle": "Infrequent Queries"
                },
                {
                    "Key": "section_1625648627436",
                    "Color": "Red",
                    "Title": "Frozen",
                    "Content": "Once data is no longer being queried, or being queried rarely, it may move from the cold tier to the frozen tier where it stays for the rest of its life.",
                    "Order": 3,
                    "Subtitle": "Rarely Queries"
                }
            ],
            "Layout": "layout-2211"
        }
    ]
}